In [2]:
import pandas as pd
import numpy as np
from sqlalchemy import create_engine
import psycopg2
import time

In [3]:
# Download calendar raw data from postgres for stage 1 ETL

conn_string = 'postgres://whnpmxwsiccrtg:53c453893549d2b1e6a4ff92e626a2a08ebcaff66678e50d33e3742f66e3e4f4@ec2-52-4-171-132.compute-1.amazonaws.com/d2ajro4cjr10lb'

db = create_engine(conn_string)
conn = db.connect()

start_time = time.time()
data = pd.read_sql_query('select * from "calendar"',con=conn)
print("PostGres Download Duration: {} seconds".format(time.time() - start_time))

PostGres Download Duration: 683.9170508384705 seconds

In [4]:
data

,listing_id,date,available,price,adjusted_price,minimum_nights,maximum_nights
0,1885504,2019-01-17,f,$97.00,$61.00,3,30
1,1885504,2019-01-18,f,$135.00,$85.00,2,30
2,1885504,2019-01-19,f,$135.00,$85.00,2,30
3,1885504,2019-01-20,t,$97.00,$61.00,1,30
4,1885504,2019-01-21,t,$97.00,$61.00,1,30
...,...,...,...,...,...,...,...
2189265,31340454,2020-01-12,t,$249.00,$249.00,2,1125
2189266,31340454,2020-01-13,t,$124.00,$124.00,2,1125
2189267,31340454,2020-01-14,t,$124.00,$124.00,2,1125
2189268,31340454,2020-01-15,t,$124.00,$124.00,2,1125
2189269,31340454,2020-01-16,t,$124.00,$124.00,2,1125

In [5]:
data=data.rename(columns={'listing_id':'id'})
data.head()

,id,date,available,price,adjusted_price,minimum_nights,maximum_nights
0,1885504,2019-01-17,f,$97.00,$61.00,3,30
1,1885504,2019-01-18,f,$135.00,$85.00,2,30
2,1885504,2019-01-19,f,$135.00,$85.00,2,30
3,1885504,2019-01-20,t,$97.00,$61.00,1,30
4,1885504,2019-01-21,t,$97.00,$61.00,1,30

In [6]:
data['date']=pd.to_datetime(data['date'])
data['day'] = data['date'].dt.day_name()
data['month'] = data['date'].dt.month

In [8]:
data.head()

,id,date,available,price,adjusted_price,minimum_nights,maximum_nights,day,month
0,1885504,2019-01-17,f,$97.00,$61.00,3,30,Thursday,1
1,1885504,2019-01-18,f,$135.00,$85.00,2,30,Friday,1
2,1885504,2019-01-19,f,$135.00,$85.00,2,30,Saturday,1
3,1885504,2019-01-20,t,$97.00,$61.00,1,30,Sunday,1
4,1885504,2019-01-21,t,$97.00,$61.00,1,30,Monday,1

In [9]:
data.loc[(data.day =="Friday"),"day"]='weekend'
data.loc[(data.day =="Saturday"),"day"]='weekend'
data.loc[(data.day =="Monday"),"day"]='weekday'
data.loc[(data.day =="Tuesday"),"day"]='weekday'
data.loc[(data.day =="Wednesday"),"day"]='weekday'
data.loc[(data.day =="Thursday"),"day"]='weekday'
data.loc[(data.day =="Sunday"),"day"]='weekday'

In [10]:
data.head()

,id,date,available,price,adjusted_price,minimum_nights,maximum_nights,day,month
0,1885504,2019-01-17,f,$97.00,$61.00,3,30,weekday,1
1,1885504,2019-01-18,f,$135.00,$85.00,2,30,weekend,1
2,1885504,2019-01-19,f,$135.00,$85.00,2,30,weekend,1
3,1885504,2019-01-20,t,$97.00,$61.00,1,30,weekday,1
4,1885504,2019-01-21,t,$97.00,$61.00,1,30,weekday,1

In [11]:
data_new = data.drop(['date','available','adjusted_price','minimum_nights','maximum_nights'],axis=1)

In [12]:
data_new.head()

        id    price      day  month
0  1885504   $97.00  weekday      1
1  1885504  $135.00  weekend      1
2  1885504  $135.00  weekend      1
3  1885504   $97.00  weekday      1
4  1885504   $97.00  weekday      1

In [13]:
data_new.dtypes

id        int64
price    object
day      object
month     int64
dtype: object

In [14]:
data_new['price']=data_new['price'].str.replace('$','')
data_new['price']=data_new['price'].str.replace(',','')

In [22]:
data_new['price']=data_new['price'].astype(float)

In [23]:
data_new.count()

id       2189270
price    2189270
day      2189270
month    2189270
dtype: int64

In [16]:
data_grouped=data_new.groupby(['id','day','month']).mean().reset_index()

In [20]:
data_grouped.head()

     id      day  month  price
0  6422  weekday      1   40.0
1  6422  weekday      2   40.0
2  6422  weekday      3   40.0
3  6422  weekday      4   40.0
4  6422  weekday      5   40.0

In [21]:
data_grouped.count()

id       143952
day      143952
month    143952
price    143952
dtype: int64

In [24]:
# Upload Stage 1 calendar ETL to PostGres

start_time = time.time()
data_grouped.to_sql('calendar_clean', con=conn, if_exists='replace', index=False)
print("PostGres Upload Duration: {} seconds".format(time.time() - start_time))

PostGres Upload Duration: 5102.0709664821625 seconds